'''
변수는 저장공간이다.

x = 0

x : 저장공간의 이름
= : 대입연산자
0 : 값 ( 상수 )
'''

# 자료형 (Type) 
'''
int( 정수 )
str( 문자열 )
float( 실수 )
bool( 논리형 )
'''

# 변수 선언 ( 메모리에 할당 )

'''

변수의 초기화
  변수명 = 초기값

     * 주의  *
    같은 이름으로 선언은 가능하나 
      이전 변수는 사라짐

    초기화를 반드시 해준다.
      되도록이면 페이지의 상단에 한번에 선언한다.

'''

# 변수명의 주의사항

'''

1. 문자부터 시작한다.
2. 특수문자는 사용할 수 없다.
  단, _는 사용이 가능하다.

3. 되도록이면 소문자를 사용한다.
4. 변수명은 의미있게 작성한다.
5. 변수명은 공백을 사용할 수 없다.

'''


## 실습 시작 ! ##

x = 10 # int

print(type(x)) # <class 'int'>

x = 10.9
print(type(x)) # <class 'float'>


# 작은 따옴표와 큰 따옴표는 차이가 없다.

name = "변동헌"
print(type(name)) # <class 'str'>

name = '이순신'
print(type(name)) # <class 'str'>

name = "파이썬"
age = 10
height = 120.88
hobby = "피아노"

print(name, age, height, hobby)